In [5]:
# Importing dependencies
import pandas as pd

#Giving file paths
Schools = "Resources/schools_complete.csv"
Students = "Resources/students_complete.csv"

# reading schools and students data file using pandas dataframe
schools_df = pd.read_csv(Schools)
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
#Reading students data in dataframe
students_df = pd.read_csv(Students)
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [7]:
# combining the two dataframes into a single one
schools_complete_df = pd.merge(students_df, schools_df, how = "left", on = "school_name")
schools_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [8]:
#calculating total schools
total_schools = len(schools_complete_df["school_name"].unique())
total_schools

15

In [9]:
#calculating total students
total_students = len(schools_complete_df["student_name"])
total_students

39170

In [10]:
#calculating total budget

#defining new dataframe for unique schools name [note this can also be done by using drop_duplicate function]
unique_schools_df = pd.DataFrame(schools_complete_df.groupby("school_name",as_index=False).first())
unique_schools_df.head()

,school_name,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
0,Bailey High School,17871,Blake Martin,M,9th,75,59,7,District,4976,3124928
1,Cabrera High School,16013,Olivia Short,F,11th,94,94,6,Charter,1858,1081356
2,Figueroa High School,2917,Amy Jacobs,F,10th,85,87,1,District,2949,1884411
3,Ford High School,34796,Michael Mercado,M,9th,66,94,13,District,2739,1763916
4,Griffin High School,12262,Heather Wright,F,11th,79,68,4,Charter,1468,917500

In [11]:
# calculating total budget 
total_budget = unique_schools_df["budget"].sum()
total_budget

24649428

In [12]:
#calculating average math score
average_math_score = schools_complete_df["math_score"].sum()/total_students
average_math_score

78.98537145774827

In [13]:
#calculating average reading score
average_reading_score = schools_complete_df["reading_score"].sum()/total_students
average_reading_score

81.87784018381414

In [14]:
# calculating passing math
math_pass_df = pd.DataFrame(schools_complete_df.loc[schools_complete_df.math_score >= 70])
math_pass_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [15]:
#calculating % passing math
total_passing_math = len(math_pass_df["student_name"])
percent_passing_math = 100*(total_passing_math/total_students)
percent_passing_math

74.9808526933878

In [16]:
# calculating % passing reading
reading_pass_df = pd.DataFrame(schools_complete_df.loc[schools_complete_df.reading_score >= 70])
total_passing_reading = len(reading_pass_df["student_name"])
percent_passing_reading = 100*(total_passing_reading/total_students)
percent_passing_reading

85.80546336482001

In [17]:
# calculating % passing students
total_pass_df = pd.DataFrame(schools_complete_df.loc[(schools_complete_df.math_score >=70) & 
                                                     (schools_complete_df.reading_score >=70)])
total_pass = len(total_pass_df["student_name"])
percent_pass = 100*(total_pass/total_students)
percent_pass

65.17232575950983

In [21]:
### district summary
district_summary = pd.DataFrame({"total schools": total_schools, "Total students": total_students, "Total Budget": total_budget,
                                "Average Math Score": average_math_score, "Average Reading Score": average_reading_score, 
                                 "Percentage Passing math": percent_passing_math, 
                                 "Percent Passing Reading": percent_passing_reading, "Total Pass Percent": percent_pass},index=[0])
district_summary

,total schools,Total students,Total Budget,Average Math Score,Average Reading Score,Percentage Passing math,Percent Passing Reading,Total Pass Percent
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

# School summary

In [48]:
#creating school summary dataframa
school_name = unique_schools_df["school_name"]
school_type = unique_schools_df["type"]
total_school_students = unique_schools_df["size"]
total_school_budget = unique_schools_df["budget"]
per_student_budget = total_school_budget/total_school_students
average_math_score = pd.DataFrame(schools_complete_df.groupby("school_name",as_index=False)["math_score"].mean())
average_reading_score = pd.DataFrame(schools_complete_df.groupby("school_name",as_index=False)["reading_score"].mean())

In [80]:
average_math_score

              school_name  math_score
0      Bailey High School   77.048432
1     Cabrera High School   83.061895
2    Figueroa High School   76.711767
3        Ford High School   77.102592
4     Griffin High School   83.351499
5   Hernandez High School   77.289752
6      Holden High School   83.803279
7       Huang High School   76.629414
8     Johnson High School   77.072464
9        Pena High School   83.839917
10  Rodriguez High School   76.842711
11    Shelton High School   83.359455
12     Thomas High School   83.418349
13     Wilson High School   83.274201
14     Wright High School   83.682222

In [87]:
# calculating math pass percentage for each school
math_pass_school = math_pass_df.groupby("school_name", as_index = False)["Student ID"].count()
#math_pass_school
percentage_math_pass_school = 100*(math_pass_school["Student ID"]/total_school_students)

In [90]:
# calculating reading pass percentage for each school
reading_pass_school = reading_pass_df.groupby("school_name", as_index = False)["Student ID"].count()
#reading_pass_school
percentage_reading_pass_school = 100*(reading_pass_school["Student ID"]/total_school_students)

In [91]:
#calculating overall passing students percentage
total_pass_school = total_pass_df.groupby("school_name", as_index = False)["Student ID"].count()
#total_pass_school
percentage_total_pass_school = 100*(total_pass_school["Student ID"]/total_school_students)

In [72]:
# # creating summary table for school summary
# school_summary = {"School Name":school_name, "School Type":school_type, 
#                                  "Total Students":total_school_students, "Total Budget":total_school_budget,
#                                  "Per Student Budget":per_student_budget, "Average Math Score":average_math_score,
#                                  "Average Reading Score":average_reading_score, "% Passing Math":percentage_math_pass_school,
#                                  "% Passing Reading":percentage_reading_pass_school,"% Overall Passing":percentage_total_pass_school}
# school_summary_df = pd.DataFrame(school_summary, columns =["School Name", "Total Students", "Total Budget","Per Student budget"])
                                                           
#                                                           # "Average Math Score","Average Reading Score", "% Passing Math",
#                                                           #"% Passing Reading", "% Overall Passing"])
# #school_summary.keys()
# school_summary_df

              School Name  Total Students  Total Budget Per Student budget
0      Bailey High School            4976       3124928                NaN
1     Cabrera High School            1858       1081356                NaN
2    Figueroa High School            2949       1884411                NaN
3        Ford High School            2739       1763916                NaN
4     Griffin High School            1468        917500                NaN
5   Hernandez High School            4635       3022020                NaN
6      Holden High School             427        248087                NaN
7       Huang High School            2917       1910635                NaN
8     Johnson High School            4761       3094650                NaN
9        Pena High School             962        585858                NaN
10  Rodriguez High School            3999       2547363                NaN
11    Shelton High School            1761       1056600                NaN
12     Thomas High School            1635       1043130                NaN
13     Wilson High School            2283       1319574                NaN
14     Wright High School            1800       1049400                NaN

In [88]:
percentage_math_pass_school

0     66.680064
1     94.133477
2     65.988471
3     68.309602
4     93.392371
5     66.752967
6     92.505855
7     65.683922
8     66.057551
9     94.594595
10    66.366592
11    93.867121
12    93.272171
13    93.867718
14    93.333333
dtype: float64

In [75]:
#creating summary table
#selecting columns from unique_schools_df
column_list = ["school_name","type","size","budget"]
school_summary_df = pd.DataFrame(unique_schools_df[column_list])
school_summary_df.head()

            school_name      type  size   budget
0    Bailey High School  District  4976  3124928
1   Cabrera High School   Charter  1858  1081356
2  Figueroa High School  District  2949  1884411
3      Ford High School  District  2739  1763916
4   Griffin High School   Charter  1468   917500

In [93]:
#adding more columns
school_summary_df["Per Student Budget"] = school_summary_df["budget"]/school_summary_df["size"]
school_summary_df["Average Math Score"] = average_math_score["math_score"]
school_summary_df["Average Reading Score"] = average_reading_score["reading_score"]
school_summary_df["% Passing Math"] = percentage_math_pass_school
school_summary_df["% Passing Reading"] = percentage_reading_pass_school
school_summary_df["% Overall Passing"] = percentage_total_pass_school
school_summary_df.head()

,school_name,type,size,budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
3,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [95]:
school_summary_df = school_summary_df.rename(columns = {"school_name":"School Name", "type": "School Type", 
                                                        "size":"Total Students", "budget":"Total Budget"})
school_summary_df.head()

,School Name,School Type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
3,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

# Highest performing schools (by % overall passing)